00test/Laser_2D_refer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2D model: Section 1 plane (z=0) extruded to z=-1..+1 mm.
// x: axial (laser direction), y: radial (+y upward), z: 2 mm thickness (empty BC).
// Units: mm (scale 0.001).

scale 0.001;

vertices
(
    // ---- z = -1 layer (indices 0-14) ----
    (1      -5.32   -1)     //0   (2D V0)
    (-55    -30.63  -1)     //1   (2D V1)
    (-55    -26.84  -1)     //2   (2D V2)
    (0      -4.62   -1)     //3   (2D V3)
    (0      -1.2    -1)     //4   (2D V4)
    (1      -1.2    -1)     //5   (2D V5)
    (1      -50     -1)     //6   (2D V6)
    (70.00  -50     -1)     //7   (2D V7)
    (70.00  -10     -1)     //8   (2D V8)
    (70.00  -1.2    -1)     //9   (2D V9)
    (0      0       -1)     //10  center at x=0
    (1      0       -1)     //11  center at x=1
    (70.00  0       -1)     //12  center at x=70
    (-62.7  -33.93  -1)     //13  (2D V83)
    (-62.7  -26.84  -1)     //14  (2D V84)

    // ---- z = +1 layer (indices 15-29) ----
    (1      -5.32   1)      //15  (2D V0)
    (-55    -30.63  1)      //16  (2D V1)
    (-55    -26.84  1)      //17  (2D V2)
    (0      -4.62   1)      //18  (2D V3)
    (0      -1.2    1)      //19  (2D V4)
    (1      -1.2    1)      //20  (2D V5)
    (1      -50     1)      //21  (2D V6)
    (70.00  -50     1)      //22  (2D V7)
    (70.00  -10     1)      //23  (2D V8)
    (70.00  -1.2    1)      //24  (2D V9)
    (0      0       1)      //25  center at x=0
    (1      0       1)      //26  center at x=1
    (70.00  0       1)      //27  center at x=70
    (-62.7  -33.93  1)      //28  (2D V83)
    (-62.7  -26.84  1)      //29  (2D V84)
);

edges
(
);

// hex (v0 v1 v2 v3  v4 v5 v6 v7)
// z=-1 face: v0-v3  (counterclockwise when viewed from z=-1 looking +z)
// z=+1 face: v4-v7  (same xy order)
// Cell count: (nx  ny  1)

blocks
(
    // Block A: central strip, r=0..1.2, x=0..1
    //   corners (z-1): 10(0,0) 4(0,-1.2) 5(1,-1.2) 11(1,0)
    hex (11 10 4 5  26 25 19 20) (10 6 1) simpleGrading (1 1 1)

    // Block B: central strip, r=0..1.2, x=1..70
    hex (12 11 5 9  27 26 20 24) (70 6 1) simpleGrading (1 1 1)

    // Block C: powder inlet annulus, r=26.84..30.63, x=-55..0
    hex (2 1 0 3  17 16 15 18) (6 40 1) simpleGrading (1 1 1)

    // Block D: inner annulus between axis and powder, r=1.2..4.62, x=0..1
    hex (0 5 4 3  15 20 19 18) (1 6 1) simpleGrading (1 1 1)

    // Block E: outer annulus, r=5.32..50, x=1..70
    hex (8 0 6 7  23 15 21 22) (70 20 1) simpleGrading (1 0.3 1)

    // Block F: intermediate annulus, r=1.2..5.32, x=1..70
    hex (9 8 0 5  24 23 15 20) (70 10 1) simpleGrading (1 1 1)

    // Block G: upstream nozzle extension, r=26.84..33.93, x=-62.7..-55
    hex (2 14 13 1  17 29 28 16) (6 5 1) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            // Nozzle outer wall (r=33.93): x=-62.7..-55
            (13 1  28 16)
            // Nozzle inner wall (r=26.84): x=-62.7..-55
            (14 2  29 17)
            // Outer sheath wall (r=26.84..30.63 outer): x=-55..0
            (1 0  16 15)
            // Inner sheath wall (r=26.84 inner): x=-55..0
            (2 3  17 18)
        );
    }

    powderInlet
    {
        type patch;
        faces
        (
            (13 14  28 29)
        );
    }

    gasInlet
    {
        type patch;
        faces
        (
            // x=0, r=1.2..4.62
            (4 3  19 18)
            // x=0, r=0..1.2
            (10 4  25 19)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            // x=70, r=0..1.2
            (9 12  24 27)
            // x=70, r=1.2..10
            (8 9  23 24)
            // x=70, r=10..50
            (7 8  22 23)
        );
    }

    front
    {
        type empty;
        faces
        (
            (25 19 20 26)
            (26 20 24 27)
            (18 15 16 17)
            (18 19 20 15)
            (21 15 23 22)
            (15 20 24 23)
            (28 29 17 16)
        );
    }

    back
    {
        type empty;
        faces
        (
            (10 4 5 11)
            (11 5 9 12)
            (3 0 1 2)
            (3 4 5 0)
            (6 0 8 7)
            (0 5 9 8)
            (13 14 2 1)
        );
    }
);

// ************************************************************************* //
