00test/Laser_2D_refer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       664960;
    }
    powderInlet
    {
        type            patch;
        nFaces          480;
        startFace       672160;
    }
    gasInlet
    {
        type            patch;
        nFaces          1200;
        startFace       672640;
    }
    outlet
    {
        type            patch;
        nFaces          10000;
        startFace       673840;
    }
)

// ************************************************************************* //
