00test/Laser_2D_refer/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.005;

boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.005;
    }

    powderInlet
    {
        type            fixedValue;
        value           uniform 0.02;
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.005;
        value           uniform 0.005;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
