00test/Laser_2D_refer/0/nut.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.5e-05;

boundaryField
{
    walls
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    powderInlet
    {
        type            fixedValue;
        value           uniform 0.00018;
    }

    gasInlet
    {
        type            fixedValue;
        value           uniform 9e-06;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 4.5e-05;
        value           uniform 4.5e-05;
    }

    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
